package main

import (
	"fmt"
)

func main() {
	// 隣接する要素を比較して入れ替えを繰り返す。
	// 効率は低め
	// 実装簡単
	// 安定している -> 追加のメモリをほとんど使用しないソート方法になる。
	// インプレースアルゴリズム -> 空間計算量O(1)
	nums := []int{9, 59, 3, 24, 5, 0}
	fmt.Println(nums)
	nums = BubbleSort(nums)
	fmt.Println(nums)
}

func BubbleSort(nums []int) []int {
	// 配列の長さを取得
	length := len(nums)

	// 外側のループ
	// 		内側のループ
	//		ソート済みの部分を無視して、未ソート部分だけを効率的に処理する
	// 終了条件が難しくないか？
	// 以下に手書きで試す
	// 1, 8, 10, 3, 2, 5
	// 1, 8, 10, 3, 2, 5
	// 1, 8, 10, 3, 2, 5
	// 1, 8, 3, 10, 2, 5
	// 1, 8, 3, 2, 10, 5
	// 1, 8, 3, 2, 5, 10 -> 1週目
	// 1, 8, 3, 2, 5, 10
	// 1, 3, 8, 2, 5, 10
	// 1, 3, 2, 8, 5, 10
	// 1, 3, 2, 5, 8, 10 -> 2週目
	// 1, 3, 2, 5, 8, 10
	// 1, 2, 3, 5, 8, 10
	// 1, 2, 3, 5, 8, 10
	// ... イメージつかめたので以降は省略

	for i := 0; i < length; i++ {
		// 最大値を右側に詰めるループ
		// 比較回数はlength - i - 1
		for j := 0; j < length-i-1; j++ {
			// 比較時に左側の方が大きかったら交換する
			if nums[j+1] < nums[j] {
				nums[j+1], nums[j] = nums[j], nums[j+1]
			}
		}
	}
	return nums
}
